IDEA Open Model
CrossSectionFactory.FillWeldedT Method
Compatible with IDEA StatiCa 20.1
 Fill steel section of welded T
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public static void FillWeldedT(
	CrossSectionParameter css,
	double b,
	double h,
	double tw,
	double tf
)
Public Shared Sub FillWeldedT (
	css As CrossSectionParameter,
	b As Double,
	h As Double,
	tw As Double,
	tf As Double
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
b
Type: System.Double
Width of flange
h
Type: System.Double
Height of web
tw
Type: System.Double
Web thickness
tf
Type: System.Double
Flange thickness
Remarks
Dimension of welded T section
Examples
 This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 2;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double b = 0.2;
double h = 0.4;
double tw = 0.02;
double tf = 0.35;
CrossSectionFactory.FillWeldedT(css, b, h, tw, tf);
openStructModel.AddObject(css);
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace